In [ ]:
#Clase 04

In [2]:
#Ejemplo 1
import pandas as pd

In [4]:
modelos = ['A4 3.0 Quattro 4dr manual',
 'A4 3.0 Quattro 4dr auto',
 'A6 3.0 4dr',
 'A6 3.0 Quattro 4dr',
 'A4 3.0 convertible 2dr']
peso = [3583, 3627, 3561, 3880, 3814]
precios = ['$33,430', '$34,480', '$36,640', '$39,640', '$42,490']

In [9]:
#Construyo mis series
Autos_precio = pd.Series(precios,index=modelos) 

Autos_precio

A4 3.0 Quattro 4dr manual    $33,430
A4 3.0 Quattro 4dr auto      $34,480
A6 3.0 4dr                   $36,640
A6 3.0 Quattro 4dr           $39,640
A4 3.0 convertible 2dr       $42,490
dtype: object

In [10]:
#Construyo mis series
Autos_peso = pd.Series(peso,index=modelos)

Autos_peso

A4 3.0 Quattro 4dr manual    3583
A4 3.0 Quattro 4dr auto      3627
A6 3.0 4dr                   3561
A6 3.0 Quattro 4dr           3880
A4 3.0 convertible 2dr       3814
dtype: int64

In [11]:
#Construyo mi diccionario
{'Peso':Autos_peso,'Precio':Autos_precio}

{'Peso': A4 3.0 Quattro 4dr manual    3583
 A4 3.0 Quattro 4dr auto      3627
 A6 3.0 4dr                   3561
 A6 3.0 Quattro 4dr           3880
 A4 3.0 convertible 2dr       3814
 dtype: int64,
 'Precio': A4 3.0 Quattro 4dr manual    $33,430
 A4 3.0 Quattro 4dr auto      $34,480
 A6 3.0 4dr                   $36,640
 A6 3.0 Quattro 4dr           $39,640
 A4 3.0 convertible 2dr       $42,490
 dtype: object}

In [12]:
#Construyo un Data Frame
Autos = pd.DataFrame({'Peso':Autos_peso,'Precio':Autos_precio})

Autos

                           Peso   Precio
A4 3.0 Quattro 4dr manual  3583  $33,430
A4 3.0 Quattro 4dr auto    3627  $34,480
A6 3.0 4dr                 3561  $36,640
A6 3.0 Quattro 4dr         3880  $39,640
A4 3.0 convertible 2dr     3814  $42,490

In [17]:
Autos.Peso >=3600

A4 3.0 Quattro 4dr manual    False
A4 3.0 Quattro 4dr auto       True
A6 3.0 4dr                   False
A6 3.0 Quattro 4dr            True
A4 3.0 convertible 2dr        True
Name: Peso, dtype: bool

In [18]:
Autos.loc[Autos.Peso>=3600]

                         Peso   Precio
A4 3.0 Quattro 4dr auto  3627  $34,480
A6 3.0 Quattro 4dr       3880  $39,640
A4 3.0 convertible 2dr   3814  $42,490

In [19]:
Autos.loc[(Autos.Peso>=3600) & (Autos.Peso<=3800)]

                         Peso   Precio
A4 3.0 Quattro 4dr auto  3627  $34,480

In [13]:
#Ejemplo 2
import numpy as np

In [14]:
Ajedrez_64 = np.arange(1,65).reshape(8,8)
Ajedrez_df = pd.DataFrame(
Ajedrez_64,
columns=range(1,9),
index=['A','B','C','D','E','F','G','H']
) 
Ajedrez_df

    1   2   3   4   5   6   7   8
A   1   2   3   4   5   6   7   8
B   9  10  11  12  13  14  15  16
C  17  18  19  20  21  22  23  24
D  25  26  27  28  29  30  31  32
E  33  34  35  36  37  38  39  40
F  41  42  43  44  45  46  47  48
G  49  50  51  52  53  54  55  56
H  57  58  59  60  61  62  63  64